Repository: agiletec-inc/cmd-ime
Catalog: apps/cmd-ime-swift/Sources/CmdIMESwift/Resources/Localizable.xcstrings
Source language: en
Languages: ja, ko, vi, zh_hans, zh_hant

# menu.preferencesTitle
source: ⌘IME %@ — Preferences…
ja: ⌘IME %@ — 環境設定…
ko: ⌘IME %@ — 환경설정…
vi: ⌘IME %@ — Tùy chỉnh…
zh_hans: ⌘IME %@ — 偏好设置…
zh_hant: ⌘IME %@ — 偏好設定…

# menu.checkForUpdates
source: Check for Updates…
ja: アップデートを確認…
ko: 업데이트 확인…
vi: Kiểm tra cập nhật…
zh_hans: 检查更新…
zh_hant: 檢查更新…

# menu.restart
source: Restart
ja: 再起動
ko: 다시 시작
vi: Khởi động lại
zh_hans: 重新启动
zh_hant: 重新啟動

# menu.quit
source: Quit
ja: 終了
ko: 종료
vi: Thoát
zh_hans: 退出
zh_hant: 退出

# menu.quitApp
source: Quit ⌘IME
ja: ⌘IMEを終了
ko: ⌘IME 종료
vi: Thoát ⌘IME
zh_hans: 退出 ⌘IME
zh_hant: 退出 ⌘IME

# menu.edit
source: Edit
ja: 編集
ko: 편집
vi: Chỉnh sửa
zh_hans: 编辑
zh_hant: 編輯

# menu.cut
source: Cut
ja: カット
ko: 잘라내기
vi: Cắt
zh_hans: 剪切
zh_hant: 剪下

# menu.copy
source: Copy
ja: コピー
ko: 복사하기
vi: Sao chép
zh_hans: 拷贝
zh_hant: 拷貝

# menu.paste
source: Paste
ja: ペースト
ko: 붙여넣기
vi: Dán
zh_hans: 粘贴
zh_hant: 貼上

# menu.selectAll
source: Select All
ja: すべてを選択
ko: 모두 선택
vi: Chọn Tất Cả
zh_hans: 全选
zh_hant: 全選

# menu.window
source: Window
ja: ウインドウ
ko: 윈도우
vi: Cửa sổ
zh_hans: 窗口
zh_hant: 視窗

# menu.close
source: Close
ja: 閉じる
ko: 닫기
vi: Đóng
zh_hans: 关闭
zh_hant: 關閉

# menu.minimize
source: Minimize
ja: しまう
ko: Dock에 넣기
vi: Thu nhỏ
zh_hans: 缩小
zh_hant: 縮小

# notification.updateAvailableTitle
source: ⌘IME has an update available
ja: ⌘IMEの新しいバージョンがあります
ko: ⌘IME 업데이트가 있습니다
vi: ⌘IME có bản cập nhật mới
zh_hans: ⌘IME 有可用更新
zh_hant: ⌘IME 有可用更新

# notification.updateAvailableBody
source: Version %@ is ready to install
ja: v%@ をインストールできます
ko: 버전 %@을(를) 설치할 수 있습니다
vi: Phiên bản %@ đã sẵn sàng để cài đặt
zh_hans: 版本 %@ 已可安装
zh_hant: 版本 %@ 已可安裝

# general.launchAtLogin
source: Launch at Login
ja: ログイン時に開く
ko: 로그인 시 열기
vi: Mở khi đăng nhập
zh_hans: 登录时打开
zh_hant: 登入時打開

# general.showMenuBarIcon
source: Show menu bar icon
ja: メニューバーアイコンを表示
ko: 메뉴 막대 아이콘 보기
vi: Hiện biểu tượng trên thanh menu
zh_hans: 在菜单栏中显示图标
zh_hant: 在選單列中顯示圖示

# general.quitWithCmdQ
source: Quit ⌘IME with ⌘Q
ja: ⌘Qで⌘IMEを終了
ko: ⌘Q로 ⌘IME 종료
vi: Thoát ⌘IME bằng ⌘Q
zh_hans: 使用 ⌘Q 退出 ⌘IME
zh_hant: 使用 ⌘Q 退出 ⌘IME

# general.quitWithCmdQFootnote
source: When off, ⌘Q just closes this window and ⌘IME keeps running in the menu bar. You can quit anytime from the menu bar icon.
ja: オフの場合、⌘Qはこのウインドウを閉じるだけで、⌘IMEはメニューバーで動作し続けます。メニューバーアイコンからいつでも終了できます。
ko: 꺼져 있으면 ⌘Q는 이 창만 닫고 ⌘IME는 메뉴 막대에서 계속 실행됩니다. 메뉴 막대 아이콘에서 언제든지 종료할 수 있습니다.
vi: Khi tắt, ⌘Q chỉ đóng cửa sổ này và ⌘IME vẫn chạy trên thanh menu. Bạn có thể thoát bất cứ lúc nào từ biểu tượng trên thanh menu.
zh_hans: 关闭时，⌘Q 仅关闭此窗口，⌘IME 会继续在菜单栏中运行。您可以随时从菜单栏图标退出。
zh_hant: 關閉時，⌘Q 僅會關閉此視窗，⌘IME 會繼續在選單列中執行。您可以隨時從選單列圖示退出。

# general.checkForUpdatesOnLaunch
source: Check for updates on launch
ja: 起動時にアップデートを確認
ko: 시작할 때 업데이트 확인
vi: Kiểm tra cập nhật khi khởi động
zh_hans: 启动时检查更新
zh_hant: 啟動時檢查更新

# general.checkNow
source: Check Now
ja: 今すぐ確認
ko: 지금 확인
vi: Kiểm tra ngay
zh_hans: 立即检查
zh_hant: 立即檢查

# general.versionFormat
source: Version %@
ja: バージョン %@
ko: 버전 %@
vi: Phiên bản %@
zh_hans: 版本 %@
zh_hant: 版本 %@

# general.inputSwitchingSection
source: Input Switching
ja: 入力切り替え
ko: 입력 전환
vi: Chuyển đổi nhập liệu
zh_hans: 输入切换
zh_hant: 輸入切換

# general.modePickerLabel
source: Mode
ja: モード
ko: 모드
vi: Chế độ
zh_hans: 模式
zh_hant: 模式

# general.modeOff
source: Off
ja: オフ
ko: 끄기
vi: Tắt
zh_hans: 关闭
zh_hant: 關閉

# general.modePerApp
source: Per app
ja: アプリごと
ko: 앱별
vi: Theo ứng dụng
zh_hans: 按应用
zh_hant: 依應用程式

# general.modeSmart
source: Smart
ja: スマート
ko: 스마트
vi: Thông minh
zh_hans: 智能
zh_hant: 智慧

# general.modeOffDescription
source: No automatic switching. Input source stays as-is when you switch apps.
ja: 自動切り替えは行いません。アプリを切り替えても入力ソースはそのまま維持されます。
ko: 자동으로 전환하지 않습니다. 앱을 전환해도 입력 소스가 그대로 유지됩니다.
vi: Không tự động chuyển đổi. Nguồn nhập vẫn giữ nguyên khi bạn chuyển ứng dụng.
zh_hans: 不自动切换。切换应用时输入源保持不变。
zh_hant: 不會自動切換。切換應用程式時輸入來源會維持不變。

# general.modePerAppDescription
source: Remembers and restores the input source for each app when you switch.
ja: アプリごとに入力ソースを記憶し、切り替え時に復元します。
ko: 앱마다 입력 소스를 기억했다가 전환할 때 복원합니다.
vi: Ghi nhớ và khôi phục nguồn nhập cho từng ứng dụng khi bạn chuyển đổi.
zh_hans: 为每个应用记住并恢复输入源，切换时自动还原。
zh_hant: 為每個應用程式記住並還原輸入來源，切換時自動套用。

# general.modeSmartDescription
source: Per-app memory plus auto-switch to alphanumeric in URL bars, phone, email, and ZIP fields. (Beta)
ja: アプリごとの記憶に加え、URLバーや電話番号・メール・郵便番号欄では自動的に英数入力に切り替えます。（ベータ）
ko: 앱별 기억 기능에 더해 URL 입력란, 전화번호, 이메일, 우편번호 필드에서는 자동으로 영숫자 입력으로 전환합니다. (베타)
vi: Ngoài ghi nhớ theo ứng dụng, còn tự động chuyển sang nhập chữ và số trong thanh URL, số điện thoại, email và mã bưu điện. (Beta)
zh_hans: 在按应用记忆的基础上，还会在网址栏、电话、邮箱和邮编等输入框中自动切换为英数输入。（测试版）
zh_hant: 在依應用程式記憶的基礎上，也會在網址列、電話、電子郵件與郵遞區號欄位自動切換為英數輸入。（Beta）

# general.aboutSection
source: About
ja: このアプリについて
ko: 정보
vi: Giới thiệu
zh_hans: 关于
zh_hant: 關於

# general.issuesLink
source: Issues
ja: Issue
ko: 이슈
zh_hans: 议题
zh_hant: 議題

# general.licenseLink
source: License
ja: ライセンス
ko: 라이선스
vi: Giấy phép
zh_hans: 许可证
zh_hant: 授權條款

# general.licenseFootnote
source: MIT License · Based on the original cmd-eikana by iMasanari
ja: MITライセンス · iMasanariによるオリジナル cmd-eikana をベースにしています
ko: MIT 라이선스 · iMasanari의 원본 cmd-eikana를 기반으로 함
vi: Giấy phép MIT · Dựa trên dự án gốc cmd-eikana của iMasanari
zh_hans: MIT 许可证 · 基于 iMasanari 的原始项目 cmd-eikana
zh_hant: MIT 授權條款 · 基於 iMasanari 的原始專案 cmd-eikana

# exclusions.description
source: ⌘IME will not remap keys when these apps are frontmost.
ja: これらのアプリが最前面にあるとき、⌘IMEはキーの割り当てを行いません。
ko: 이 앱들이 맨 앞에 있을 때는 ⌘IME가 키를 다시 매핑하지 않습니다.
vi: ⌘IME sẽ không ánh xạ lại phím khi các ứng dụng này đang ở phía trước.
zh_hans: 当这些应用位于最前面时，⌘IME 不会重新映射按键。
zh_hant: 當這些應用程式在最前面時，⌘IME 不會重新對應按鍵。

# exclusions.excludedHeader
source: Excluded
ja: 除外中
ko: 제외됨
vi: Đã loại trừ
zh_hans: 已排除
zh_hant: 已排除

# exclusions.emptyExcluded
source: No excluded apps yet.
ja: まだ除外されたアプリはありません。
ko: 아직 제외된 앱이 없습니다.
vi: Chưa có ứng dụng nào bị loại trừ.
zh_hans: 目前没有已排除的应用。
zh_hant: 目前沒有已排除的應用程式。

# exclusions.recentHeader
source: Recently active
ja: 最近使用したアプリ
ko: 최근 사용한 앱
vi: Gần đây đã dùng
zh_hans: 最近使用
zh_hant: 最近使用

# exclusions.addAppButton
source: Add App…
ja: アプリを追加…
ko: 앱 추가…
vi: Thêm ứng dụng…
zh_hans: 添加应用…
zh_hant: 加入應用程式…

# exclusions.addAppHelp
source: Choose any installed app to exclude
ja: 除外するアプリを選択します
ko: 제외할 설치된 앱을 선택하세요
vi: Chọn một ứng dụng đã cài đặt để loại trừ
zh_hans: 选择要排除的已安装应用
zh_hant: 選擇要排除的已安裝應用程式

# exclusions.emptyRecent
source: Switch to another app and come back to populate this list.
ja: 他のアプリに切り替えてから戻ると、このリストに表示されます。
ko: 다른 앱으로 전환했다가 돌아오면 이 목록이 채워집니다.
vi: Chuyển sang ứng dụng khác rồi quay lại để danh sách này được điền đầy đủ.
zh_hans: 切换到其他应用后再返回，此列表将会自动填充。
zh_hant: 切換到其他應用程式後再返回，此清單就會自動顯示內容。

# exclusions.openPanelMessage
source: Choose apps to exclude from ⌘IME key remapping
ja: ⌘IMEのキー割り当てから除外するアプリを選択してください
ko: ⌘IME 키 재매핑에서 제외할 앱을 선택하세요
vi: Chọn ứng dụng để loại trừ khỏi việc ánh xạ lại phím của ⌘IME
zh_hans: 选择要从 ⌘IME 按键重映射中排除的应用
zh_hant: 選擇要從 ⌘IME 按鍵重新對應中排除的應用程式

# exclusions.openPanelPrompt
source: Add
ja: 追加
ko: 추가
vi: Thêm
zh_hans: 添加
zh_hant: 加入

# keyRecorder.placeholder
source: Press a key…
ja: キーを押してください…
ko: 키를 누르세요…
vi: Nhấn một phím…
zh_hans: 请按下一个键…
zh_hant: 請按下一個按鍵…

# keyRecorder.cancel
source: Cancel
ja: キャンセル
ko: 취소
vi: Hủy
zh_hans: 取消
zh_hant: 取消

# keyRecorder.save
source: Save
ja: 保存
ko: 저장
vi: Lưu
zh_hans: 存储
zh_hant: 儲存

# shortcuts.description
source: Key: the hotkey to intercept. Action: what happens when you press it.
ja: キー：割り込むホットキーです。アクション：そのキーを押したときの動作です。
ko: 키: 가로챌 단축키입니다. 동작: 해당 키를 눌렀을 때 실행할 작업입니다.
vi: Phím: phím tắt cần chặn. Hành động: điều xảy ra khi bạn nhấn phím đó.
zh_hans: 按键：要拦截的快捷键。动作：按下该键时执行的操作。
zh_hant: 按鍵：要攔截的快捷鍵。動作：按下該鍵時執行的操作。

# shortcuts.keyColumnHeader
source: Key
ja: キー
ko: 키
vi: Phím
zh_hans: 按键
zh_hant: 按鍵

# shortcuts.actionColumnHeader
source: Action
ja: アクション
ko: 동작
vi: Hành động
zh_hans: 动作
zh_hant: 動作

# shortcuts.shadowedHelp
source: Shadowed by an earlier mapping with the same input
ja: 同じ入力を持つ前のマッピングによって無効化されています
ko: 동일한 입력을 가진 이전 매핑에 가려졌습니다
vi: Bị che khuất bởi ánh xạ trước đó có cùng đầu vào
zh_hans: 被具有相同输入的更早映射所覆盖
zh_hant: 被具有相同輸入的較早對應項目所覆蓋

# shortcuts.removeHelp
source: Remove this mapping
ja: このマッピングを削除します
ko: 이 매핑 제거
vi: Xóa ánh xạ này
zh_hans: 移除此映射
zh_hant: 移除此對應

# shortcuts.addButton
source: Add
ja: 追加
ko: 추가
vi: Thêm
zh_hans: 添加
zh_hant: 加入

# shortcuts.inputPlaceholder
source: Input
ja: 入力
ko: 입력
vi: Đầu vào
zh_hans: 输入
zh_hant: 輸入

# shortcuts.inputHelp
source: Choose the hotkey to intercept
ja: 割り込むホットキーを選択します
ko: 가로챌 단축키를 선택하세요
vi: Chọn phím tắt cần chặn
zh_hans: 选择要拦截的快捷键
zh_hant: 選擇要攔截的快捷鍵

# shortcuts.actionHelp
source: Choose what happens when this key is pressed
ja: このキーを押したときの動作を選択します
ko: 이 키를 눌렀을 때 실행할 작업을 선택하세요
vi: Chọn điều xảy ra khi phím này được nhấn
zh_hans: 选择按下此键时执行的操作
zh_hant: 選擇按下此按鍵時執行的操作

# shortcuts.presetLeftCommand
source: Left ⌘ (Left Command)
ja: 左⌘ (左Command)
ko: 왼쪽 ⌘ (왼쪽 Command)
vi: ⌘ trái (Command trái)
zh_hans: 左⌘ (左 Command)
zh_hant: 左⌘ (左 Command)

# shortcuts.presetRightCommand
source: Right ⌘ (Right Command)
ja: 右⌘ (右Command)
ko: 오른쪽 ⌘ (오른쪽 Command)
vi: ⌘ phải (Command phải)
zh_hans: 右⌘ (右 Command)
zh_hant: 右⌘ (右 Command)

# shortcuts.presetLeftShift
source: Left ⇧ (Left Shift)
ja: 左⇧ (左Shift)
ko: 왼쪽 ⇧ (왼쪽 Shift)
vi: ⇧ trái (Shift trái)
zh_hans: 左⇧ (左 Shift)
zh_hant: 左⇧ (左 Shift)

# shortcuts.presetRightShift
source: Right ⇧ (Right Shift)
ja: 右⇧ (右Shift)
ko: 오른쪽 ⇧ (오른쪽 Shift)
vi: ⇧ phải (Shift phải)
zh_hans: 右⇧ (右 Shift)
zh_hant: 右⇧ (右 Shift)

# shortcuts.presetLeftOption
source: Left ⌥ (Left Option)
ja: 左⌥ (左Option)
ko: 왼쪽 ⌥ (왼쪽 Option)
vi: ⌥ trái (Option trái)
zh_hans: 左⌥ (左 Option)
zh_hant: 左⌥ (左 Option)

# shortcuts.presetRightOption
source: Right ⌥ (Right Option)
ja: 右⌥ (右Option)
ko: 오른쪽 ⌥ (오른쪽 Option)
vi: ⌥ phải (Option phải)
zh_hans: 右⌥ (右 Option)
zh_hant: 右⌥ (右 Option)

# shortcuts.presetLeftControl
source: Left ⌃ (Left Control)
ja: 左⌃ (左Control)
ko: 왼쪽 ⌃ (왼쪽 Control)
vi: ⌃ trái (Control trái)
zh_hans: 左⌃ (左 Control)
zh_hant: 左⌃ (左 Control)

# shortcuts.presetRightControl
source: Right ⌃ (Right Control)
ja: 右⌃ (右Control)
ko: 오른쪽 ⌃ (오른쪽 Control)
vi: ⌃ phải (Control phải)
zh_hans: 右⌃ (右 Control)
zh_hant: 右⌃ (右 Control)

# shortcuts.actionSwitchToAlphanumeric
source: Switch to Alphanumeric
ja: 英数に切り替え
ko: 영숫자로 전환
vi: Chuyển sang chữ và số
zh_hans: 切换到英数
zh_hant: 切換到英數

# shortcuts.actionSwitchToKana
source: Switch to Kana
ja: かなに切り替え
ko: 가나로 전환
vi: Chuyển sang Kana
zh_hans: 切换到假名
zh_hant: 切換到假名

# shortcuts.actionSwitchToInputSource
source: Switch to Input Source
ja: 入力ソースに切り替え
ko: 입력 소스로 전환
vi: Chuyển sang nguồn nhập
zh_hans: 切换到输入法
zh_hant: 切換到輸入方式

# shortcuts.actionDisableKey
source: Disable key
ja: キーを無効化
ko: 키 비활성화
vi: Vô hiệu hóa phím
zh_hans: 禁用按键
zh_hant: 停用按鍵

# settingsTabs.general
source: General
ja: 一般
ko: 일반
vi: Chung
zh_hans: 通用
zh_hant: 一般

# settingsTabs.shortcuts
source: Shortcuts
ja: ショートカット
ko: 단축키
vi: Phím tắt
zh_hans: 快捷键
zh_hant: 快捷鍵

# settingsTabs.exclusions
source: Exclusions
ja: 除外設定
ko: 제외 항목
vi: Loại trừ
zh_hans: 排除项
zh_hant: 排除項目

# alert.tapFailureTitle
source: ⌘IME could not start its keyboard listener
ja: ⌘IMEはキーボードリスナーを開始できませんでした
ko: ⌘IME가 키보드 리스너를 시작할 수 없습니다
vi: ⌘IME không thể khởi động trình lắng nghe bàn phím
zh_hans: ⌘IME 无法启动键盘监听
zh_hant: ⌘IME 無法啟動鍵盤監聽

# alert.tapFailureBody
source: Open System Settings → Privacy & Security → Accessibility, remove ⌘IME if listed, re-add it, then restart the app.
ja: システム設定 → プライバシーとセキュリティ → アクセシビリティを開き、⌘IMEが表示されている場合は削除してから再度追加し、アプリを再起動してください。
ko: 시스템 설정 → 개인정보 보호 및 보안 → 손쉬운 사용을 열고, 목록에 ⌘IME가 있으면 제거한 다음 다시 추가하고 앱을 재시작하세요.
vi: Mở Cài đặt Hệ thống → Quyền riêng tư & Bảo mật → Trợ năng, xóa ⌘IME nếu có trong danh sách, thêm lại, rồi khởi động lại ứng dụng.
zh_hans: 打开系统设置 → 隐私与安全性 → 辅助功能，如果列表中有 ⌘IME，请先移除再重新添加，然后重新启动应用。
zh_hant: 打開系統設定 → 隱私權與安全性 → 輔助使用，如果清單中有 ⌘IME，請先移除再重新加入，然後重新啟動應用程式。

# alert.openSystemSettings
source: Open System Settings
ja: システム設定を開く
ko: 시스템 설정 열기
vi: Mở Cài đặt Hệ thống
zh_hans: 打开系统设置
zh_hant: 打開系統設定

# shortcuts.presetCapsLock
source: ⇪ (Caps Lock)
zh_hans: ⇪ (大写锁定)
zh_hant: ⇪ (大寫鎖定)
